app/controllers/messages_controller.rb

  def create
	Message.create(check_params)
---
INSERT INTO "messages" ("m_name", "m_subject", "m_description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["m_name", "Siva"], ["m_subject", "mail"], ["m_description", "czczc"], ["created_at", "2015-09-04 03:54:51.148084"], ["updated_at", "2015-09-04 03:54:51.148084"]]